# 24 Functions for Date and Time

In [1]:
import pandas as pd

In [4]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [7]:
pd.to_datetime(ufo.Time)

0       1930-06-01 22:00:00
1       1930-06-30 20:00:00
2       1931-02-15 14:00:00
3       1931-06-01 13:00:00
4       1933-04-18 19:00:00
                ...
18236   2000-12-31 23:00:00
18237   2000-12-31 23:00:00
18238   2000-12-31 23:45:00
18239   2000-12-31 23:45:00
18240   2000-12-31 23:59:00
Name: Time, Length: 18241, dtype: datetime64[ns]

In [8]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [9]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [10]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [11]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [12]:
ufo.Time.dt.hour

0        22
1        20
2        14
3        13
4        19
         ..
18236    23
18237    23
18238    23
18239    23
18240    23
Name: Time, Length: 18241, dtype: int64

In [13]:
ufo.Time.dt.minute

0         0
1         0
2         0
3         0
4         0
         ..
18236     0
18237     0
18238    45
18239    45
18240    59
Name: Time, Length: 18241, dtype: int64

In [15]:
# https://pandas.pydata.org/docs/reference/arrays.html#datetime-data
ufo.Time.dt.is_leap_year

0        False
1        False
2        False
3        False
4        False
         ...
18236     True
18237     True
18238     True
18239     True
18240     True
Name: Time, Length: 18241, dtype: bool

In [16]:
ufo.Time.dt.is_month_start

0         True
1        False
2        False
3         True
4        False
         ...
18236    False
18237    False
18238    False
18239    False
18240    False
Name: Time, Length: 18241, dtype: bool

In [17]:
ufo.Time.max()

Timestamp('2000-12-31 23:59:00')

In [22]:
# date = pd.to_datetime('1998/1/1')
# date = pd.to_datetime('1998-1-1')
date = pd.to_datetime('1998.1.1')

In [23]:
date

Timestamp('1998-01-01 00:00:00')

In [24]:
ufo.loc[ufo.Time > date, :]

                City Colors Reported Shape Reported State                Time
11089      St. Louis            BLUE          FLASH    MO 1998-01-01 00:58:00
11090      Allentown             NaN          LIGHT    PA 1998-01-01 01:42:00
11091  Elizabethtown             NaN       TRIANGLE    IL 1998-01-01 02:00:00
11092          Huelo             NaN          LIGHT    HI 1998-01-01 04:00:00
11093        Hoboken             NaN           DISK    NJ 1998-01-01 06:00:00
...              ...             ...            ...   ...                 ...
18236     Grant Park             NaN       TRIANGLE    IL 2000-12-31 23:00:00
18237    Spirit Lake             NaN           DISK    IA 2000-12-31 23:00:00
18238    Eagle River             NaN            NaN    WI 2000-12-31 23:45:00
18239    Eagle River             RED          LIGHT    WI 2000-12-31 23:45:00
18240           Ybor             NaN           OVAL    FL 2000-12-31 23:59:00

[7152 rows x 5 columns]